import random




def mian():

    list_vep = ["меч", "кинжал", "сикира", "одати", "косса", "нож", "копьё"]
    list_mod_befor = ["железный", "каменый", "серебреный", "красный", "кровавый", "золотой"]
    list_mod_after = ["из железа", "из каменой породы", "темной таинственой стали", "из неизвестгного материала", "из зжатай воды "]
    list_mod_2 = ["царстве сонца", "подземном царстве", "замке забытых надежд", "кузьне на берегу моря из костей", "заснеженых пиках теневых гор"]
    list_mod_3 = ["великим богом покровителя солнца", "кузницом высшим дворфом", "великим богм покровителем тени ", "истиным ткачем судьбы", "по приказу короля средних земель"]

    

    if random.randint(0,1):
        print(random.choice(list_vep), random.choice(list_mod_after), end=" ")
    else:
        print(random.choice(list_mod_befor), random.choice(list_vep), end=" ")

    print("кованый в", random.choice(list_mod_2), random.choice(list_mod_3))


mian()